## base
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 8 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                           |
|--------|---------------------------------------------------------|
| add    | `aws_route53_zone.base_hosted_zone`                     |
| delete | `aws_iam_access_key.security_tools`                     |
|        | `aws_iam_group.security_tools_automation`               |
|        | `aws_iam_group_membership.security_tools_automation`    |
|        | `aws_iam_group_policy.security_tools_automation_policy` |
|        | `aws_iam_user.security_tools`                           |
|        | `aws_network_acl_rule.smtp_egress`                      |
|        | `aws_ssm_parameter.smtp_password`                       |
|        | `aws_ssm_parameter.smtp_username`                       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_access_key.security_tools will be destroyed
  # (because aws_iam_access_key.security_tools is not in configuration)
  - resource "aws_iam_access_key" "security_tools" {
      - create_date          = "2022-05-15T22:37:16Z" -> null
      - id                   = "AKIA3SCJE6FYYRIV7DJU" -> null
      - secret               = (sensitive value)
      - ses_smtp_password_v4 = (sensitive value)
      - status               = "Active" -> null
      - user                 = "SecurityToolsNotificationIAMUser" -> null
    }

  # aws_iam_group.security_tools_automation will be destroyed
  # (because aws_iam_group.security_tools_automation is not in configuration)
  - resource "aws_iam_group" "security_tools_automation" {
      - arn       = "arn:aws:iam::794722365809:group/automation/securitytools/automation-security-tools-notification-group" -> null
      - id        = "automation-security-tools-notification-group" -> null
      - name      = "automation-security-tools-notification-group" -> null
      - path      = "/automation/securitytools/" -> null
      - unique_id = "AGPA3SCJE6FY5UZQBVYJN" -> null
    }

  # aws_iam_group_membership.security_tools_automation will be destroyed
  # (because aws_iam_group_membership.security_tools_automation is not in configuration)
  - resource "aws_iam_group_membership" "security_tools_automation" {
      - group = "automation-security-tools-notification-group" -> null
      - id    = "SecurityToolsNotificationIAMGroupMembership" -> null
      - name  = "SecurityToolsNotificationIAMGroupMembership" -> null
      - users = [
          - "SecurityToolsNotificationIAMUser",
        ] -> null
    }

  # aws_iam_group_policy.security_tools_automation_policy will be destroyed
  # (because aws_iam_group_policy.security_tools_automation_policy is not in configuration)
  - resource "aws_iam_group_policy" "security_tools_automation_policy" {
      - group  = "automation-security-tools-notification-group" -> null
      - id     = "automation-security-tools-notification-group:automation-security-tools-notification-group-policy" -> null
      - name   = "automation-security-tools-notification-group-policy" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ses:SendRawEmail",
                          - "ses:SendEmail",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ses:ca-central-1:794722365809:identity/security.cdssandbox.xyz"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # aws_iam_user.security_tools will be destroyed
  # (because aws_iam_user.security_tools is not in configuration)
  - resource "aws_iam_user" "security_tools" {
      - arn           = "arn:aws:iam::794722365809:user/SecurityToolsNotificationIAMUser" -> null
      - force_destroy = false -> null
      - id            = "SecurityToolsNotificationIAMUser" -> null
      - name          = "SecurityToolsNotificationIAMUser" -> null
      - path          = "/" -> null
      - tags          = {} -> null
      - tags_all      = {} -> null
      - unique_id     = "AIDA3SCJE6FYWLWP7ATUN" -> null
    }

  # aws_network_acl_rule.smtp_egress will be destroyed
  # (because aws_network_acl_rule.smtp_egress is not in configuration)
  - resource "aws_network_acl_rule" "smtp_egress" {
      - cidr_block     = "0.0.0.0/0" -> null
      - egress         = true -> null
      - from_port      = 465 -> null
      - id             = "nacl-1431178767" -> null
      - network_acl_id = "acl-0d1ad57fa9c0143de" -> null
      - protocol       = "6" -> null
      - rule_action    = "allow" -> null
      - rule_number    = 200 -> null
      - to_port        = 465 -> null
    }

  # aws_route53_zone.base_hosted_zone will be created
  + resource "aws_route53_zone" "base_hosted_zone" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "security.cdssandbox.xyz"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "CostCentre" = "security-tools-794722365809"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "security-tools-794722365809"
          + "Terraform"  = "true"
        }
      + zone_id             = (known after apply)
    }

  # aws_ssm_parameter.smtp_password will be destroyed
  # (because aws_ssm_parameter.smtp_password is not in configuration)
  - resource "aws_ssm_parameter" "smtp_password" {
      - allowed_pattern = "" -> null
      - arn             = "arn:aws:ssm:ca-central-1:794722365809:parameter/base/smtp_password" -> null
      - data_type       = "text" -> null
      - description     = "" -> null
      - id              = "/base/smtp_password" -> null
      - key_id          = "alias/aws/ssm" -> null
      - name            = "/base/smtp_password" -> null
      - tags            = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools"
          - "Terraform"  = "true"
        } -> null
      - tags_all        = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools"
          - "Terraform"  = "true"
        } -> null
      - tier            = "Standard" -> null
      - type            = "SecureString" -> null
      - value           = (sensitive value)
      - version         = 1 -> null
    }

  # aws_ssm_parameter.smtp_username will be destroyed
  # (because aws_ssm_parameter.smtp_username is not in configuration)
  - resource "aws_ssm_parameter" "smtp_username" {
      - arn       = "arn:aws:ssm:ca-central-1:794722365809:parameter/base/smtp_username" -> null
      - data_type = "text" -> null
      - id        = "/base/smtp_username" -> null
      - key_id    = "alias/aws/ssm" -> null
      - name      = "/base/smtp_username" -> null
      - tags      = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools"
          - "Terraform"  = "true"
        } -> null
      - tags_all  = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools"
          - "Terraform"  = "true"
        } -> null
      - tier      = "Standard" -> null
      - type      = "SecureString" -> null
      - value     = (sensitive value)
      - version   = 1 -> null
    }

Plan: 1 to add, 0 to change, 8 to destroy.

Changes to Outputs:
  + hosted_zone_id = (known after apply)

Warning: Argument is deprecated

  with module.athena.aws_s3_bucket.this,
  on .terraform/modules/athena/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 7 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
